# Wall

## Description
Procedure Wall creates a wall object in a VectorWorks document. The wall will adopt the current default settings for walls when created.

```pascal
PROCEDURE Wall(
				p1X,p1Y : REAL;
				p2X,p2Y : REAL);
```

```python
def vs.Wall(p1, p2):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Start point of wall.|
|p2|REAL|End point of wall.|

## Remarks
[sd 8/18/98]

## See Also
VS Functions:
RoundWall

## Version
Availability: from MiniCAD4.0

## Category
* Objects - Walls